use MD_MyBase;

--1
SELECT ДОГОВОР.ID_договора, КРЕДИТ.Вид_кредита
FROM ДОГОВОР INNER JOIN КРЕДИТ
ON ДОГОВОР.ID_кредита = КРЕДИТ.ID_кредита

--2
SELECT КРЕДИТ.Вид_кредита, ДОГОВОР.ID_договора
FROM КРЕДИТ INNER JOIN ДОГОВОР
ON КРЕДИТ.ID_кредита = ДОГОВОР.ID_кредита AND КРЕДИТ.Вид_кредита LIKE '%Кратко%'

--3
SELECT DISTINCT ДОГОВОР.ID_договора, КЛИЕНТ.Фирма_клиент, КРЕДИТ.Вид_кредита,
Case
when (ДОГОВОР.ID_договора = 1) then 'один'
when (ДОГОВОР.ID_договора = 2) then 'два'
when (ДОГОВОР.ID_договора = 3) then 'три'
when (ДОГОВОР.ID_договора = 4) then 'четыре'
when (ДОГОВОР.ID_договора = 5) then 'пять'
else 'другой идентификатор'
end [Идентификатор]
FROM ДОГОВОР
INNER JOIN КРЕДИТ ON ДОГОВОР.ID_кредита = КРЕДИТ.ID_кредита
INNER JOIN КЛИЕНТ ON ДОГОВОР.ID_клиента = КЛИЕНТ.ID_клиента
where ДОГОВОР.ID_договора between 1 and 5
order by ДОГОВОР.ID_договора

--4
SELECT ISNULL(КЛИЕНТ.Контактное_лицо, '***')[Контактное лицо], ДОГОВОР.ID_договора
FROM КЛИЕНТ LEFT OUTER JOIN ДОГОВОР
On КЛИЕНТ.ID_клиента = ДОГОВОР.ID_клиента

--5
SELECT*FROM ДОГОВОР FULL OUTER JOIN КЛИЕНТ
ON ДОГОВОР.ID_клиента = КЛИЕНТ.ID_клиента
WHERE ДОГОВОР.Сумма IS NULL

SELECT*FROM КЛИЕНТ FULL OUTER JOIN ДОГОВОР
ON ДОГОВОР.ID_клиента = КЛИЕНТ.ID_клиента
WHERE ДОГОВОР.Сумма IS NULL

--6
select ДОГОВОР.ID_договора, КРЕДИТ.Вид_кредита
from ДОГОВОР cross join КРЕДИТ
where ДОГОВОР.ID_кредита = КРЕДИТ.ID_кредита