use MD_MyBase;

--1
select КРЕДИТ.Вид_кредита, КЛИЕНТ.Вид_собственности,
round(avg(cast(ДОГОВОР.Сумма as float)), 2) as [Средняя сумма]
from ДОГОВОР
inner join КРЕДИТ on КРЕДИТ.ID_кредита = ДОГОВОР.ID_кредита
inner join КЛИЕНТ on КЛИЕНТ.ID_клиента = ДОГОВОР.ID_клиента
where КЛИЕНТ.Вид_собственности like '%Государственная%'
group by rollup (КРЕДИТ.Вид_кредита, КЛИЕНТ.Вид_собственности)

--2
select КРЕДИТ.Вид_кредита, КЛИЕНТ.Вид_собственности,
round(avg(cast(ДОГОВОР.Сумма as float)), 2) as [Средняя сумма]
from ДОГОВОР
inner join КРЕДИТ on КРЕДИТ.ID_кредита = ДОГОВОР.ID_кредита
inner join КЛИЕНТ on КЛИЕНТ.ID_клиента = ДОГОВОР.ID_клиента
where КЛИЕНТ.Вид_собственности like '%Государственная%'
group by cube (КРЕДИТ.Вид_кредита, КЛИЕНТ.Вид_собственности)

--3
select КРЕДИТ.Вид_кредита, КЛИЕНТ.Вид_собственности,
round(avg(cast(ДОГОВОР.Сумма as float)), 2) as [Средняя сумма]
from ДОГОВОР
inner join КРЕДИТ on КРЕДИТ.ID_кредита = ДОГОВОР.ID_кредита
inner join КЛИЕНТ on КЛИЕНТ.ID_клиента = ДОГОВОР.ID_клиента
where КЛИЕНТ.Вид_собственности like '%Государственная%'
group by КРЕДИТ.Вид_кредита, КЛИЕНТ.Вид_собственности
union
--union all
select КРЕДИТ.Вид_кредита, КЛИЕНТ.Вид_собственности,
round(avg(cast(ДОГОВОР.Сумма as float)), 2) as [Средняя сумма]
from ДОГОВОР
inner join КРЕДИТ on КРЕДИТ.ID_кредита = ДОГОВОР.ID_кредита
inner join КЛИЕНТ on КЛИЕНТ.ID_клиента = ДОГОВОР.ID_клиента
where КРЕДИТ.Вид_кредита like '%Автокредит%'
group by КРЕДИТ.Вид_кредита, КЛИЕНТ.Вид_собственности

--4
select КРЕДИТ.Вид_кредита, КЛИЕНТ.Вид_собственности,
round(avg(cast(ДОГОВОР.Сумма as float)), 2) as [Средняя сумма]
from ДОГОВОР
inner join КРЕДИТ on КРЕДИТ.ID_кредита = ДОГОВОР.ID_кредита
inner join КЛИЕНТ on КЛИЕНТ.ID_клиента = ДОГОВОР.ID_клиента
where КЛИЕНТ.Вид_собственности like '%Государственная%'
group by КРЕДИТ.Вид_кредита, КЛИЕНТ.Вид_собственности
intersect
select КРЕДИТ.Вид_кредита, КЛИЕНТ.Вид_собственности,
round(avg(cast(ДОГОВОР.Сумма as float)), 2) as [Средняя сумма]
from ДОГОВОР
inner join КРЕДИТ on КРЕДИТ.ID_кредита = ДОГОВОР.ID_кредита
inner join КЛИЕНТ on КЛИЕНТ.ID_клиента = ДОГОВОР.ID_клиента
where КРЕДИТ.Вид_кредита like '%Автокредит%'
group by КРЕДИТ.Вид_кредита, КЛИЕНТ.Вид_собственности

--5
select КРЕДИТ.Вид_кредита, КЛИЕНТ.Вид_собственности,
round(avg(cast(ДОГОВОР.Сумма as float)), 2) as [Средняя сумма]
from ДОГОВОР
inner join КРЕДИТ on КРЕДИТ.ID_кредита = ДОГОВОР.ID_кредита
inner join КЛИЕНТ on КЛИЕНТ.ID_клиента = ДОГОВОР.ID_клиента
where КЛИЕНТ.Вид_собственности like '%Государственная%'
group by КРЕДИТ.Вид_кредита, КЛИЕНТ.Вид_собственности
except
select КРЕДИТ.Вид_кредита, КЛИЕНТ.Вид_собственности,
round(avg(cast(ДОГОВОР.Сумма as float)), 2) as [Средняя сумма]
from ДОГОВОР
inner join КРЕДИТ on КРЕДИТ.ID_кредита = ДОГОВОР.ID_кредита
inner join КЛИЕНТ on КЛИЕНТ.ID_клиента = ДОГОВОР.ID_клиента
where КРЕДИТ.Вид_кредита like '%Автокредит%'
group by КРЕДИТ.Вид_кредита, КЛИЕНТ.Вид_собственности