use MD_MyBase;

--1
select КРЕДИТ.Вид_кредита,
max(КРЕДИТ.Ставка)[Максимальная ставка],
min(КРЕДИТ.Ставка)[Минимальная ставка],
avg(КРЕДИТ.Ставка)[Среднее значение ставки],
sum(КРЕДИТ.Ставка)[Сумма ставок],
count(КРЕДИТ.Ставка)[Количество данных ставок]
from КРЕДИТ inner join ДОГОВОР
on КРЕДИТ.ID_кредита = ДОГОВОР.ID_кредита
group by КРЕДИТ.Вид_кредита

--2
select*
from(select case when ДОГОВОР.Сумма between 5000 and 50000 then '5000-50000'
				 when ДОГОВОР.Сумма between 50000 and 80000 then '50000-80000'
				 when ДОГОВОР.Сумма between 80000 and 100000 then '80000-100000'
				 else 'Другая сумма'
				 end[Пределы сумм], COUNT(*)[Количество]
from ДОГОВОР group by case when ДОГОВОР.Сумма between 5000 and 50000 then '5000-50000'
				 when ДОГОВОР.Сумма between 50000 and 80000 then '50000-80000'
				 when ДОГОВОР.Сумма between 80000 and 100000 then '80000-100000'
				 else 'Другая сумма'
				 end) as T
				 order by case[Пределы сумм]
				 when '5000-50000' then 3
				 when '50000-80000' then 2
				 when '80000-100000' then 1
				 else 0
				 end

--3
select КЛИЕНТ.Вид_собственности,
ROUND(avg(cast(ДОГОВОР.Сумма as float)), 2) as [Средняя сумма]
from ДОГОВОР
inner join КЛИЕНТ on КЛИЕНТ.ID_клиента = ДОГОВОР.ID_клиента
group by КЛИЕНТ.Вид_собственности
order by [Средняя сумма] desc

--4
select КЛИЕНТ.Вид_собственности,
ROUND(avg(cast(ДОГОВОР.Сумма as float)), 2) as [Средняя сумма]
from ДОГОВОР
inner join КЛИЕНТ on КЛИЕНТ.ID_клиента = ДОГОВОР.ID_клиента
where КЛИЕНТ.Вид_собственности like 'Государственная'
group by КЛИЕНТ.Вид_собственности
order by [Средняя сумма] desc

--5
select КРЕДИТ.Вид_кредита, КЛИЕНТ.Адрес,
ROUND(avg(cast(ДОГОВОР.Сумма as float)), 2) as [Средняя сумма]
from ДОГОВОР
inner join КРЕДИТ on КРЕДИТ.ID_кредита = ДОГОВОР.ID_кредита
inner join КЛИЕНТ on КЛИЕНТ.ID_клиента = ДОГОВОР.ID_клиента
where КЛИЕНТ.Адрес like '%Минск%'
group by КРЕДИТ.Вид_кредита, КЛИЕНТ.Адрес
order by [Средняя сумма] desc

--6
select КЛИЕНТ.Вид_собственности, COUNT(*)[Количество предприятий]
from КЛИЕНТ inner join ДОГОВОР
on КЛИЕНТ.ID_клиента = ДОГОВОР.ID_клиента
group by КЛИЕНТ.Вид_собственности, ДОГОВОР.Сумма
having ДОГОВОР.Сумма = '10000' or ДОГОВОР.Сумма = '50000'
